doc/CrateWritingGuidelines.org
Crate Writing Guidelines

You are of course free to write crates however you wish, but these are the
guiding principles used in the pallet core crates.

  - Add configuration data to :parameters
  - Separate fie installation from content generation
  - Prefer content generation to templates
  - Don't create large monolithic crates

* Package based install

Package based installs are preferred.

  - ensure services are enabled and started by default

* Source based install


* Finally

Not all of the core crates live up to these, yet.
