CrateWritingGuidelines.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Crate Writing Guidelines</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-21 12:56:55 EST"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Crate Writing Guidelines</h1>

<p>You are of course free to write crates however you wish, but these are the
guiding principles used in the pallet core crates.
</p>
<ul>
<li>
Add configuration data to :parameters
</li>
<li>
Separate fie installation from content generation
</li>
<li>
Prefer content generation to templates
</li>
<li>
Don't create large monolithic crates
</li>
</ul>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Package based install </a></li>
<li><a href="#sec-2">2 Source based install </a></li>
<li><a href="#sec-3">3 Finally </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Package based install </h2>
<div class="outline-text-2" id="text-1">


<p>
Package based installs are preferred.
</p>
<ul>
<li>
ensure services are enabled and started by default
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Source based install </h2>
<div class="outline-text-2" id="text-2">



</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Finally </h2>
<div class="outline-text-2" id="text-3">


<p>
Not all of the core crates live up to these, yet.
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2011-01-21 12:56:55 EST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
